Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.DimensionTextPlacings Enumeration
 The placing types of the dimension value text.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum DimensionTextPlacings
Public Enumeration DimensionTextPlacings
Members
Member name | Value | Description
AboveDimensionLine | 0 |  The dimension value text is placed above the dimension line.
OnDimensionLine | 1 |  The dimension value text is placed on the dimension line.
See Also
Reference
Tekla.Structures.Drawing Namespace